import pandas as pd

data = {
    'Name': ["Андрей", "Анна", "Василий", "Антон", "Екатерина", "Сергей", "Анастасия", "Иван", "Александр", "Михаил"],
    'Surname': ["Антонов", "Иванова", "Петров", "Попов", "Носкова", "Милютин", "Степанова", "Сидоров", "Попов", "Петров"],
    'Post': ["Директор", "Главный бухгалтер", "Инженер", "Инженер", "Экономист", "Водитель", "Зав.Хоз.", "Техник", "Программист", "Программист"],
    'Salary': [50000, 45000, 30000, 30000, 35000, 25000, 40000, 35000, 35000, 40000],
    'Age': [35, 30, 28, 27, 30, 25, 26, 33, 32, 27]
}
df = pd.DataFrame(data)

sorted_df = df.sort_values(by='Salary')
print(sorted_df)