USE Students;
GO

INSERT INTO lstStud (FullName, Course, SpecID, BirthDate) VALUES
('Иванов Иван Иванович', 2, 1, '2001-05-15'),
('Петров Петр Петрович', 3, 2, '2000-08-20'),
('Сидорова Анна Сергеевна', 1, 3, '2003-03-10'),
('Кузнецов Михаил Алексеевич', 4, 4, '1999-11-25'),
('Васильева Елена Дмитриевна', 2, 5, '2001-07-12'),
('Николаев Артем Валерьевич', 3, 6, '2000-02-18'),
('Морозова Ольга Павловна', 1, 7, '2003-09-05'),
('Зайцев Игорь Сергеевич', 2, 8, '2001-12-30'),
('Ковалева Анастасия Владимировна', 4, 9, '1999-04-14'),
('Смирнов Александр Андреевич', 3, 10, '2000-06-22');
GO
